FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STMTouch_Driver/src/tsl_acq_stm32f3xx.c
  if (GPIO_InitStructure.GPIO_Pin != 0)
  {
    GPIO_Init(GPIOB, &GPIO_InitStructure);
  }

  // GPIOC
#if defined(STM32F30X)
#if TSLPRM_TSC_GROUP3_IO1 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
#endif // STM32F30X

#if defined(STM32F37X)
  GPIO_InitStructure.GPIO_Pin = 0;
#if TSLPRM_TSC_GROUP3_IO1 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_4;
#endif
#if TSLPRM_TSC_GROUP3_IO2 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_5;
#endif
  if (GPIO_InitStructure.GPIO_Pin != 0)
  {
    GPIO_Init(GPIOC, &GPIO_InitStructure);
  }
#endif // STM32F37X

  // GPIOD
  GPIO_InitStructure.GPIO_Pin = 0;

#if defined(STM32F37X)
#if TSLPRM_TSC_GROUP6_IO3 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
#endif
#if TSLPRM_TSC_GROUP6_IO4 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
#endif
#endif // STM32F37X

#if TSLPRM_TSC_GROUP8_IO1 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
#endif
#if TSLPRM_TSC_GROUP8_IO2 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
#endif
#if TSLPRM_TSC_GROUP8_IO3 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
#endif
#if TSLPRM_TSC_GROUP8_IO4 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
#endif
  if (GPIO_InitStructure.GPIO_Pin != 0)
  {
    GPIO_Init(GPIOD, &GPIO_InitStructure);
  }

  // GPIOE
  GPIO_InitStructure.GPIO_Pin = 0;
#if TSLPRM_TSC_GROUP7_IO1 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
#endif
#if TSLPRM_TSC_GROUP7_IO2 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
#endif
#if TSLPRM_TSC_GROUP7_IO3 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
#endif
#if TSLPRM_TSC_GROUP7_IO4 == SAMPCAP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
#endif
  if (GPIO_InitStructure.GPIO_Pin != 0)
  {
    GPIO_Init(GPIOE, &GPIO_InitStructure);
  }

  // Alternate function Output Push-Pull for Channel and Shield IOs
  //---------------------------------------------------------------

  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;

  // GPIOA
  GPIO_InitStructure.GPIO_Pin = 0;
#if (TSLPRM_TSC_GROUP1_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP1_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_0;
#endif
#if (TSLPRM_TSC_GROUP1_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP1_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_1;
#endif
#if (TSLPRM_TSC_GROUP1_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP1_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_2;
#endif
#if (TSLPRM_TSC_GROUP1_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP1_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_3;
#endif
#if (TSLPRM_TSC_GROUP2_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP2_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_4;
#endif
#if (TSLPRM_TSC_GROUP2_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP2_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_5;
#endif
#if (TSLPRM_TSC_GROUP2_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP2_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_6;
#endif
#if (TSLPRM_TSC_GROUP2_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP2_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_7;
#endif
#if (TSLPRM_TSC_GROUP4_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP4_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_9;
#endif
#if (TSLPRM_TSC_GROUP4_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP4_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_10;
#endif
#if (TSLPRM_TSC_GROUP4_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP4_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_13;
#endif
#if (TSLPRM_TSC_GROUP4_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP4_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_14;
#endif
  if (GPIO_InitStructure.GPIO_Pin != 0)
  {
    GPIO_Init(GPIOA, &GPIO_InitStructure);
  }

  // GPIOB
  GPIO_InitStructure.GPIO_Pin = 0;

#if defined(STM32F30X)
#if (TSLPRM_TSC_GROUP3_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP3_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_0;
#endif
#if (TSLPRM_TSC_GROUP3_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP3_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_1;
#endif
#if (TSLPRM_TSC_GROUP3_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP3_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_2;
#endif
#if (TSLPRM_TSC_GROUP5_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_3;
#endif
#if (TSLPRM_TSC_GROUP5_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_4;
#endif
#if (TSLPRM_TSC_GROUP5_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_6;
#endif
#if (TSLPRM_TSC_GROUP5_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_7;
#endif
#if (TSLPRM_TSC_GROUP6_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_11;
#endif
#if (TSLPRM_TSC_GROUP6_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_12;
#endif
#if (TSLPRM_TSC_GROUP6_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_13;
#endif
#if (TSLPRM_TSC_GROUP6_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_14;
#endif
#endif // STM32F30X

#if defined(STM32F37X)
#if (TSLPRM_TSC_GROUP3_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP3_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_0;
#endif
#if (TSLPRM_TSC_GROUP3_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP3_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_1;
#endif
#if (TSLPRM_TSC_GROUP5_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_3;
#endif
#if (TSLPRM_TSC_GROUP5_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_4;
#endif
#if (TSLPRM_TSC_GROUP5_IO3 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO3 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_6;
#endif
#if (TSLPRM_TSC_GROUP5_IO4 == CHANNEL) || (TSLPRM_TSC_GROUP5_IO4 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_7;
#endif
#if (TSLPRM_TSC_GROUP6_IO1 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO1 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_14;
#endif
#if (TSLPRM_TSC_GROUP6_IO2 == CHANNEL) || (TSLPRM_TSC_GROUP6_IO2 == SHIELD)
  GPIO_InitStructure.GPIO_Pin |= GPIO_Pin_15;
#endif
#endif // STM32F37X

